app/Controllers/Admin.php

    public function dosen()
    {
        $dosenModel = new Dosen_model();
        $data['dosen'] = $dosenModel->findAll();
---
SELECT *
FROM `dosen`

    public function ruang()
    {
        $ruangModel = new Ruang_model();
        $data['ruang'] = $ruangModel->findAll();
---
SELECT *
FROM `ruang`

    public function matkul()
    {
        $matkulModel = new Matkul_model();
        $data['matkul'] = $matkulModel->findAll();

        $ruangModel = new Ruang_model();
        $dosenModel = new Dosen_model();
        $data['ruang'] = $ruangModel->findAll();
        $data['dosen'] = $dosenModel->findAll();
---
SELECT *
FROM `matkul`
SELECT *
FROM `ruang`
SELECT *
FROM `dosen`

    public function setupjadwal()
    {
        $matkulModel = new Matkul_model();
        $data['matkul'] = $matkulModel->findAll();

        $dosenModel = new Dosen_model();
        $data['dosen'] = $dosenModel->findAll();

        $ruangModel = new Ruang_model();
        $data['ruang'] = $ruangModel->findAll();

        $jadwalModel = new Jadwal_model();
        $data['jadwal'] = $jadwalModel->findAll();
---
SELECT *
FROM `matkul`
SELECT *
FROM `dosen`
SELECT *
FROM `ruang`
SELECT *
FROM `jadwal`

    public function savejadwal()
    {
        if (!$this->validate([
            'matkul' => 'required',
            'dosen' => 'required',
            'gedung' => 'required',
            'ruang' => 'required',
            'sks' => 'required|numeric',
            'hari' => 'required',
            'jam_mulai' => 'required',
            'jam_selesai' => 'required',
            'semester' => 'required|numeric',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $jadwalModel = new Jadwal_model();

        $jadwalModel->insert([
            'matkul' => $this->request->getPost('matkul'),
            'dosen' => $this->request->getPost('dosen'),
            'gedung' => $this->request->getPost('gedung'),
            'ruang' => $this->request->getPost('ruang'),
            'sks' => $this->request->getPost('sks'),
            'hari' => $this->request->getPost('hari'),
            'jam_mulai' => $this->request->getPost('jam_mulai'),
            'jam_selesai' => $this->request->getPost('jam_selesai'),
            'semester' => $this->request->getPost('semester'),
        ]);

        return redirect()->to('/admin/jadwal')->with('success', 'Jadwal berhasil disimpan.');
---
SELECT *
FROM `jadwal`