app/Controllers/Admin.php

SELECT *
FROM `prodi`
ORDER BY `id_prodi` ASC
SELECT *
FROM `fakultas`
ORDER BY `id_fakultas` ASC
---
    public function prodi()
    {
        $prodiModel = new Prodi_model();
        $fakultasModel = new Fakultas_model(); // Ambil daftar fakultas untuk dropdown

        $data['prodi'] = $prodiModel->orderBy('id_prodi', 'ASC')->findAll();
        $data['fakultas'] = $fakultasModel->orderBy('id_fakultas', 'ASC')->findAll();