app/Controllers/Admin.php

SELECT *
FROM `dosen`
---
    public function dosen()
    {
        $session = session();

        // Kirim data session ke view
        $data = [
            'nim'   => $session->get('nim'),
            'level' => $session->get('level')
        ];

        $dosenModel = new Dosen_model();
        $matkulModel = new \App\Models\Matkul_model(); // Tambahkan model matkul

        $data['dosen'] = $dosenModel->findAll();

SELECT *
FROM `matkul`
SELECT *
FROM `ruang`
SELECT *
FROM `dosen`
---
    public function matkul()
    {
        $session = session();

        // Kirim data session dan data lainnya ke view
        $data = [
            'nim'     => $session->get('nim'),
            'level'   => $session->get('level')
        ];

        $matkulModel    = new Matkul_model();
        $ruangModel     = new Ruang_model();
        $dosenModel     = new Dosen_model();
        $fakultasModel  = new Fakultas_model();
        $prodiModel     = new Prodi_model();

        $data['matkul']   = $matkulModel->findAll();
        $data['ruang']    = $ruangModel->findAll();
        $data['dosen']    = $dosenModel->findAll();