app/Controllers/Dosen.php

SELECT *
FROM `mahasiswa`
WHERE `nim` = '9'
SELECT `pengambilan`.*, `jadwal`.`matkul`, `jadwal`.`sks`, `jadwal`.`dosen` AS `nama_dosen`, `jadwal`.`hari`, `jadwal`.`jam_mulai`, `jadwal`.`jam_selesai`, `jadwal`.`semester`
FROM `pengambilan`
JOIN `jadwal` ON `pengambilan`.`id_sks` = `jadwal`.`id_jadwal`
WHERE `pengambilan`.`nim` = '9'
AND `pengambilan`.`status` = 'pending'
---
    public function konfirmasi($nim)
    {
        $db = \Config\Database::connect();

        // Ambil data mahasiswa
        $mahasiswa = $db->table('mahasiswa')->where('nim', $nim)->get()->getRowArray();

        // Ambil data pengambilan dan JOIN dengan tabel jadwal
        $pengambilan = $db->table('pengambilan')
            ->select('pengambilan.*,
                      jadwal.matkul,
                      jadwal.sks,
                      jadwal.dosen AS nama_dosen,
                      jadwal.hari,
                      jadwal.jam_mulai,
                      jadwal.jam_selesai,
                      jadwal.semester')
            ->join('jadwal', 'pengambilan.id_sks = jadwal.id_jadwal') // Ganti jadwal jika nama tabel beda
            ->where('pengambilan.nim', $nim)
            ->where('pengambilan.status', 'pending')
            ->get()
            ->getResultArray();

SELECT *
FROM `dosen`
WHERE `nidn` = '22'
 LIMIT 1
---
public function penilaian($id_matkul = null)
{
    $session = session();
    $nim = $session->get('nim'); // Diisi dengan NIDN dosen saat login

    // Cek apakah dosen sudah login
    if (!$nim) {
        return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
    }

    // Ambil data dosen berdasarkan NIDN (yang disimpan di session sebagai 'nim')
    $dosen = $this->dosenModel->where('nidn', $nim)->first();