app/Controllers/Mahasiswa.php

SELECT *
FROM `ruang`
SELECT *
FROM `dosen`
SELECT *
FROM `matkul`
SELECT *
FROM `jadwal`
---
    public function rencanastudi()
    {
        $ruangModel  = new Ruang_model();
        $dosenModel  = new Dosen_model();
        $matkulModel = new Matkul_model();
        $jadwalModel = new Jadwal_model(); // Panggil model jadwal

        $data['ruang']  = $ruangModel->findAll();
        $data['dosen']  = $dosenModel->findAll();
        $data['matkul'] = $matkulModel->findAll();
        $data['jadwal'] = $jadwalModel->findAll(); // Kirim data jadwal ke view

INSERT INTO `pengambilan` (`nim`, `id_sks`, `status`, `sks`, `matkul`) VALUES ('9', '26', 'pending', '3', 'Statiska')
---
    public function konfirmasiKrs()
    {
        $session = session();
        $nim = $session->get('nim');

        if (!$nim) {
            return redirect()->to('mahasiswa/rencanastudi')->with('error', 'Silakan login terlebih dahulu.');
        }

        $selected = $this->request->getPost('id_sks');

        if ($selected && is_array($selected)) {
            $db = \Config\Database::connect();
            $builder = $db->table('pengambilan');

            foreach ($selected as $id_sks) {
                $sks = $this->request->getPost("sks_$id_sks");
                $matkul = $this->request->getPost("matkul_$id_sks");

                $data = [
                    'nim' => $nim,
                    'id_sks' => $id_sks,
                    'status' => 'pending', // Set status jadi 'pending'
                    'sks' => $sks,
                    'matkul' => $matkul
                ];

                $builder->insert($data);