app/Models/Mahasiswa_model.php

SELECT *
FROM `mahasiswa`
---
    public function getMahasiswa($semester = null, $jurusan = null)
    {
        $builder = $this->db->table($this->table);

        if ($semester) {
            $builder->where('semester', $semester);
        }
        if ($jurusan) {
            $builder->where('jurusan', $jurusan);
        }

        return $builder->get()->getResultArray();