app/Models/Pengambilan_model.php

    public function getJadwalDisetujui($nim)
    {
        return $this->db->table('pengambilan AS p')
            ->join('jadwal AS j', 'j.id_jadwal = p.id_jadwal')
            ->select('j.hari, j.jam_mulai, j.jam_selesai, j.matkul, j.dosen, j.gedung, j.ruang, j.semester, p.sks')
            ->where('p.nim', $nim)
            ->where('p.status', 'disetujui')
            ->orderBy('j.hari', 'ASC')
            ->orderBy('j.jam_mulai', 'ASC')
            ->get()
            ->getResult();
---
SELECT `j`.`hari`, `j`.`jam_mulai`, `j`.`jam_selesai`, `j`.`matkul`, `j`.`dosen`, `j`.`gedung`, `j`.`ruang`, `j`.`semester`, `p`.`sks`
FROM `pengambilan` AS `p`
JOIN `jadwal` AS `j` ON `j`.`id_jadwal` = `p`.`id_jadwal`
WHERE `p`.`nim` = '2'
AND `p`.`status` = 'disetujui'
ORDER BY `j`.`hari` ASC, `j`.`jam_mulai` ASC