app/Models/Penilaian_model.php

SELECT `mahasiswa`.`nim`, `mahasiswa`.`nama` as `nama_mahasiswa`, `pengambilan`.`id_pengambilan`, `jadwal`.`dosen`
FROM `pengambilan`
JOIN `mahasiswa` ON `mahasiswa`.`nim` = `pengambilan`.`nim`
JOIN `jadwal` ON `jadwal`.`id_jadwal` = `pengambilan`.`id_jadwal`
WHERE `pengambilan`.`matkul` = '6'
AND `pengambilan`.`status` = 'disetujui'
AND `jadwal`.`dosen` = '17'
---
    public function getMahasiswaDiampu($id_dosen, $id_matkul)
    {
        return $this->db->table('pengambilan')
            ->select('mahasiswa.nim, mahasiswa.nama as nama_mahasiswa, pengambilan.id_pengambilan, jadwal.dosen')
            ->join('mahasiswa', 'mahasiswa.nim = pengambilan.nim')
            ->join('jadwal', 'jadwal.id_jadwal = pengambilan.id_jadwal') // Join dengan tabel jadwal untuk mendapatkan dosen
            ->where('pengambilan.matkul', $id_matkul)
            ->where('pengambilan.status', 'disetujui') // Mengambil mahasiswa yang sudah disetujui
            ->where('jadwal.dosen', $id_dosen) // Mengambil dosen berdasarkan id_dosen
            ->get()->getResult(); // Menampilkan hasil